<?php

return [
  'admin' => [
      'news' => [
          'store' => [
              'success' => 'Новость успешно добавлена',
              'fail' => 'Не удалось сохранить новость',
          ],
          'update' => [
              'success' => 'Новость успешно обновлена',
              'fail' => 'Не удалось обновить новость'
          ],
          'destroy' => [
              'success' => 'Новость успешно удалена',
              'fail' => 'Не удалось удалить новость: '
          ],
          'settings' => [
              'success' => 'Настройки успешно обновлены',
              'fail' => 'Не удалось обновить настройки'
          ]
      ],
      'gallery' => [
          'category' => [
              'store' => [
                  'success' => 'Альбом успешно добавлен',
                  'fail' => 'Не удалось сохранить альбом',
              ],
              'update' => [
                  'success' => 'Альбом успешно обновлен',
                  'fail' => 'Не удалось обновить альбом'
              ],
              'destroy' => [
                  'success' => 'Альбом успешно удален',
                  'fail' => 'Не удалось удалить альбом: '
              ],
          ],
          'image' => [
              'store' => [
                  'success' => 'Успешно добавлено',
                  'fail' => 'Не удалось сохранить',
              ],
              'update' => [
                  'success' => 'Фотография успешно обновлена',
                  'fail' => 'Не удалось обновить фотографию'
              ],
              'destroy' => [
                  'success' => 'Фотография успешно удалена',
                  'fail' => 'Не удалось удалить фотографию: '
              ],
          ]
      ],
      'catalog' => [
          'category' => [
              'store' => [
                  'success' => 'Категория успешно добавлена',
                  'fail' => 'Не удалось сохранить категорию',
              ],
              'update' => [
                  'success' => 'Категория успешно обновлена',
                  'fail' => 'Не удалось обновить категорию'
              ],
              'destroy' => [
                  'success' => 'Категория успешно удалена',
                  'fail' => 'Не удалось удалить категорию: '
              ],
              'settings' => [
                  'success' => 'Категория успешно обновлена',
                  'fail' => 'Не удалось обновить категорию'
              ]
          ],
          'product' => [
              'store' => [
                  'success' => 'Продукт успешно добавлен',
                  'fail' => 'Не удалось сохранить продукт',
              ],
              'update' => [
                  'success' => 'Продукт успешно обновлен',
                  'fail' => 'Не удалось обновить продукт'
              ],
              'destroy' => [
                  'success' => 'Продукт успешно удалена',
                  'fail' => 'Не удалось удалить продукт: ',
              ],
              'settings' => [
                  'success' => 'Продукт успешно обновлен',
                  'fail' => 'Не удалось обновить продукт',
              ]
          ]
      ],
      'header_and_footer' => [
          'update' => [
              'success' => 'Страница успешно обновлена',
              'fail' => 'Не удалось обновить страницу'
          ]
      ],
      'page' => [
          'create' => [
              'success' => 'Страница успешно добавлена',
              'fail' => 'Не удалось сохранить страницу',
          ],
          'update' => [
              'success' => 'Страница успешно обновлена',
              'fail' => 'Не удалось обновить страницу'
          ],
          'destroy' => [
              'success' => 'Страница успешно удалена',
              'fail' => 'Не удалось удалить страницу '
          ]
      ],
      'navigation_list' => [
          'create' => [
              'success' => 'Список успешно добавлен',
              'fail' => 'Не удалось сохранить список',
          ],
          'destroy' => [
              'success' => 'Список успешно удален',
              'fail' => 'Не удалось удалить cписок '
          ],
          'update' => [
              'success' => 'Список успешно обновлен',
              'fail' => 'Не удалось обновить список'
          ],
      ],
      'navigation' => [
          'create' => [
              'success' => 'Ссылка успешно добавлена',
              'fail' => 'Не удалось сохранить ссылку',
          ],
          'destroy' => [
              'success' => 'Ссылка успешно удалена',
              'fail' => 'Не удалось удалить ссылку '
          ],
          'update' => [
              'success' => 'Ссылка успешно обновлена',
              'fail' => 'Не удалось обновить ссылку'
          ],
      ],
      'settings' => [
          'update' => [
              'success' => 'Настройки успешно обновлены',
              'fail' => 'Не удалось обновить настройки'
          ],
      ],
      'category' => [
          'store' => [
              'success' => 'Категория успешно добавлена',
              'fail' => 'Не удалось сохранить категорию',
          ],
          'update' => [
              'success' => 'Категория успешно обновлена',
              'fail' => 'Не удалось обновить категорию'
          ],
          'destroy' => [
              'success' => 'Категория успешно удалена',
              'fail' => 'Не удалось удалить категорию: '
          ]
      ],
      'feedback' => [
          'store' => [
            'success' => 'Комментарий успешно оставлен',
            'fail' => 'Не удалось оставить комментарий'
          ],
          'destroy' => [
              'success' => 'Комментарий успешно удалена',
              'fail' => 'Не удалось удалить комментарий'
          ]
      ],
      'unloading' => [
          'store' => [
              'success' => 'Заявка успешно оставлена',
              'fail' => 'Не удалось оставить заявку',
          ],
          'destroy' => [
              'success' => 'Заявка успешно удалена',
              'fail' => 'Не удалось удалить заявку: '
          ]
      ]
  ]
];
